XIVN1987/DAPLink/AT32F425/src/DAP_config.h
  gpio_init_struct.gpio_pins = JTAG_TDI_PIN;
  gpio_init(JTAG_TDI_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = JTAG_TDO_PIN;
  gpio_init_struct.gpio_mode = GPIO_MODE_INPUT;
  gpio_init_struct.gpio_pull = GPIO_PULL_UP;
  gpio_init(JTAG_TDO_PORT, &gpio_init_struct);
}
 
/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, nTRST to HighZ mode (pins are unused in SWD mode).
*/ 
__STATIC_INLINE void PORT_SWD_SETUP (void) {
  gpio_bits_set(SWCLK_PORT, SWCLK_PIN);
  gpio_bits_set(SWDIO_PORT, SWDIO_PIN);

  gpio_init_type gpio_init_struct;
  gpio_default_para_init(&gpio_init_struct);
  
  gpio_init_struct.gpio_pins = SWCLK_PIN;
  gpio_init_struct.gpio_mode = GPIO_MODE_OUTPUT;
  gpio_init(SWCLK_PORT, &gpio_init_struct);
  
  gpio_init_struct.gpio_pins = SWDIO_PIN;
  gpio_init_struct.gpio_pull = GPIO_PULL_UP;
  gpio_init(SWDIO_PORT, &gpio_init_struct);
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
__STATIC_INLINE void PORT_OFF (void) {
  crm_periph_clock_enable(CRM_GPIOA_PERIPH_CLOCK, TRUE);
  crm_periph_clock_enable(CRM_GPIOB_PERIPH_CLOCK, TRUE);
  
  gpio_init_type gpio_init_struct;
  gpio_default_para_init(&gpio_init_struct);
  
  gpio_init_struct.gpio_pins = SWCLK_PIN;
  gpio_init_struct.gpio_mode = GPIO_MODE_INPUT;
  gpio_init(SWCLK_PORT, &gpio_init_struct);
  
  gpio_init_struct.gpio_pins = SWDIO_PIN;
  gpio_init(SWDIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = JTAG_TCK_PIN;
  gpio_init(JTAG_TCK_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = JTAG_TMS_PIN;
  gpio_init(JTAG_TMS_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = JTAG_TDI_PIN;
  gpio_init(JTAG_TDI_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = JTAG_TDO_PIN;
  gpio_init(JTAG_TDO_PORT, &gpio_init_struct);
}


// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN  (void) {
  return (SWCLK_PORT->idt & SWCLK_PIN) ? 1 : 0;
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_SET (void) {
  SWCLK_PORT->scr = SWCLK_PIN;
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_CLR (void) {
  SWCLK_PORT->clr = SWCLK_PIN;
}


// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_TMS_IN  (void) {
  return (SWDIO_PORT->idt & SWDIO_PIN) ? 1 : 0;
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_SET (void) {
  SWDIO_PORT->scr = SWDIO_PIN;
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_CLR (void) {
  SWDIO_PORT->clr = SWDIO_PIN;
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_IN      (void) {
  return (SWDIO_PORT->idt & SWDIO_PIN) ? 1 : 0;
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT     (uint32_t bit) {
  if(bit & 1) SWDIO_PORT->scr = SWDIO_PIN;
  else        SWDIO_PORT->clr = SWDIO_PIN;
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_ENABLE  (void) {
  SWDIO_PORT->clr = SWDIO_PIN;
  
  SWDIO_PORT->cfgr |=  (GPIO_MODE_OUTPUT << (SWDIO_PIN_INDEX * 2));
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_DISABLE (void) {
  SWDIO_PORT->cfgr &= ~(0x03             << (SWDIO_PIN_INDEX * 2));
}


// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDI_IN  (void) {
  return (JTAG_TDI_PORT->idt & JTAG_TDI_PIN) ? 1 : 0;
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_TDI_OUT (uint32_t bit) {
  if(bit & 1) JTAG_TDI_PORT->scr = JTAG_TDI_PIN;
  else        JTAG_TDI_PORT->clr = JTAG_TDI_PIN;
}


// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDO_IN  (void) {
  return (JTAG_TDO_PORT->idt & JTAG_TDO_PIN) ? 1 : 0;
}


// nTRST Pin I/O -------------------------------------------

/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nTRST_IN   (void) {
  return (0U);
}

/** nTRST I/O pin: Set Output.
\param bit JTAG TRST Test Reset pin status:
           - 0: issue a JTAG TRST Test Reset.
           - 1: release JTAG TRST Test Reset.
*/
__STATIC_FORCEINLINE void     PIN_nTRST_OUT  (uint32_t bit) {
  ; 
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nRESET_IN  (void) {
  return (nRESET_PORT->idt & nRESET_PIN) ? 1 : 0;
}

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
           - 0: issue a device hardware reset.
           - 1: release device hardware reset.
*/
extern uint8_t swd_write_word(uint32_t addr, uint32_t val);
__STATIC_FORCEINLINE void     PIN_nRESET_OUT (uint32_t bit) {
  if(bit & 1) nRESET_PORT->scr = nRESET_PIN;
  else        nRESET_PORT->clr = nRESET_PIN;
  
  if((bit & 1) == 0)
  {
    swd_write_word((uint32_t)&SCB->AIRCR, ((0x5FA << SCB_AIRCR_VECTKEY_Pos) | SCB_AIRCR_SYSRESETREQ_Msk));
  }
}

///@}


//**************************************************************************************************
/** 
\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

